[
{
  "id": 1,
  "bn": "আমলগুলোর ফলাফল নিয়তের ওপর নির্ভর করে, আর প্রত্যেক ব্যক্তি তার নিয়ত অনুযায়ী প্রতিদান পাবে। সুতরাং যার হিজরত হবে দুনিয়াবি লাভ বা কোনো নারীকে বিবাহ করার উদ্দেশ্যে, তবে তার হিজরত ঐ উদ্দেশ্যেই গণ্য হবে।",
  "en": "The reward of deeds depends upon the intentions, and every person will get the reward according to what he has intended. So whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.",
  "main": "إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى الدُّنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ",
  "ref": "Sahih al-Bukhari 1",
  "book": "Sahih al-Bukhari"
},
  {
  "id": 2,
  "bn": "আল হারিস ইবন হিশাম রাসূলুল্লাহ (সাঃ)-কে প্রশ্ন করলেন, ‘হে আল্লাহর রাসূল! আপনার কাছে ওহি কীভাবে আসে?’ রাসূল (সাঃ) বললেন, ‘কখনো এটা ঘণ্টার ধ্বনির মতো হয়, এটা সবচেয়ে কঠিন রূপ, তারপর তা শেষ হলে আমি যা বলা হয়েছে বুঝে নিই। আবার কখনো ফেরেশতা মানুষের রূপে এসে কথা বলেন এবং আমি যা বলেন, তা বুঝে নিই।’ আয়েশা (রাঃ) বলেন, ‘আমি রাসূল (সাঃ)-কে খুব ঠান্ডা দিনেও ওহি গ্রহণ করতে দেখেছি, তখনও তাঁর কপাল থেকে ঘাম ঝরছিল।’",
  "en": "Al-Harith bin Hisham asked Allah's Messenger (ﷺ), 'O Allah's Messenger! How is the Divine Inspiration revealed to you?' Allah's Messenger replied, 'Sometimes it is (revealed) like the ringing of a bell, this form of Inspiration is the hardest of all, and then this state passes off after I have grasped what is inspired. Sometimes the Angel comes in the form of a man and talks to me, and I grasp whatever he says.' 'Aisha added: Verily, I saw the Prophet (ﷺ) being inspired divinely on a very cold day and noticed the sweat dropping from his forehead (as the Inspiration was over).",
  "main": "سَأَلَ الْحَارِثُ بْنُ هِشَامٍ رَسُولَ اللَّهِ ﷺ: كَيْفَ يَأْتِيكَ الْوَحْيُ؟ فَقَالَ رَسُولُ اللَّهِ ﷺ: أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الْجَرَسِ، وَهُوَ أَشَدُّهُ عَلَيَّ، فَيُفْصَمُ عَنِّي وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ، وَأَحْيَانًا يَتَمَثَّلُ لِي الْمَلَكُ رَجُلًا فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ",
  "ref": "Sahih al-Bukhari 2",
  "book": "Sahih al-Bukhari"
  },
  {
  "id": 3,
  "bn": "ওহি প্রাপ্তির শুরুতে রাসূলুল্লাহ (সাঃ)-এর কাছে সত্য স্বপ্ন দেখা শুরু হয় যা সকালবেলার আলোর মতো বাস্তব হয়ে যেত। তারপর তিনি নির্জনতাকে ভালোবাসতে শুরু করেন। তিনি হেরা গুহায় গিয়ে অনেক দিন ধরে ইবাদত করতেন। পরে তাঁর ওপর হঠাৎ ওহি নাজিল হয় যখন তিনি হেরা গুহায় ছিলেন। তখন একজন ফেরেশতা এসে তাঁকে বললেন, ‘পড়ো’। তিনি বললেন, ‘আমি পড়তে পারি না।’ এরপর ফেরেশতা তাঁকে তিনবার জোরে চেপে ধরেন এবং বললেন, ‘তোমার প্রভুর নামে পড়ো, যিনি সৃষ্টি করেছেন, রক্ত জমাট থেকে মানুষ সৃষ্টি করেছেন...’ তারপর রাসূল (সাঃ) ভয়ে ও কাঁপতে কাঁপতে বাসায় ফিরে খাদিজা (রাঃ)-কে বললেন, ‘আমাকে ঢেকে দাও, ঢেকে দাও।’",
  "en": "The commencement of the Divine Inspiration to Allah's Messenger (ﷺ) was in the form of good dreams which came true like bright daylight... 'Read in the name of your Lord, who has created (all that exists), has created man from a clot. Read! And your Lord is the Most Generous.' (96:1-3) Then Allah's Messenger (ﷺ) returned with the Inspiration and with his heart beating severely. Then he went to Khadija bint Khuwailid and said, 'Cover me! Cover me!'",
  "main": "إِنَّ أَوَّلَ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ ﷺ مِنَ الْوَحْيِ الرُّؤْيَا الصَّادِقَةُ فِي النَّوْمِ، فَكَانَ لَا يَرَى رُؤْيَا إِلَّا جَاءَتْ مِثْلَ فَلَقِ الصُّبْحِ، ثُمَّ حُبِّبَ إِلَيْهِ الْخَلَاءُ، وَكَانَ يَخْلُو بِغَارِ حِرَاءٍ، فَيَتَحَنَّثُ فِيهِ وَهُوَ التَّعَبُّدُ، اللَّيَالِيَ ذَوَاتِ الْعَدَدِ، قَبْلَ أَنْ يَنْزِعَ إِلَى أَهْلِهِ، وَيَتَزَوَّدُ لِذَلِكَ، ثُمَّ يَرْجِعُ إِلَى خَدِيجَةَ فَيَتَزَوَّدُ لِمِثْلِهَا، حَتَّى جَاءَهُ الْحَقُّ وَهُوَ فِي",
},
{
  "id": 4,
  "bn": "জাবির ইবন আব্দুল্লাহ (রাঃ) বলেন, ওহির বিরতির সময়কাল সম্পর্কে তিনি বললেন, ‘আমি হেঁটে যাচ্ছিলাম, হঠাৎ করে আমি আকাশ থেকে একটি আওয়াজ শুনলাম। আমি তাকিয়ে দেখি, হেরা গুহায় দেখা সেই ফেরেশতা একজন চেয়ারে বসে আছেন, আকাশ ও পৃথিবীর মাঝে।’",
  "en": "Jabir bin Abdullah Al-Ansari narrated: The Prophet said, 'While I was walking, all of a sudden I heard a voice from the sky. I looked up and saw the same angel who had visited me at the cave of Hira sitting on a chair between the sky and the earth...'",
  "main": "فَبَيْنَا أَنَا أَمْشِي إِذْ سَمِعْتُ صَوْتًا مِنَ السَّمَاءِ، فَرَفَعْتُ بَصَرِي قِبَلَ السَّمَاءِ، فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ جَالِسٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالْأَرْضِ",
  "ref": "Sahih al-Bukhari 4",
  "book": "Sahih al-Bukhari"
},
  
{
  "id": 5,
  "bn": "ইবনে আব্বাস (রাঃ) বলেন, রাসূলুল্লাহ (সাঃ) ছিলেন সবচেয়ে দয়ালু ব্যক্তি। আর রমযান মাসে তিনি সবচেয়ে দয়ালু হতেন যখন জিবরাইল (আঃ) তাঁর সাথে দেখা করতেন। তিনি প্রতি রাতে রাসূল (সাঃ)-এর সাথে সাক্ষাৎ করতেন এবং কুরআন শিখাতেন।",
  "en": "Narrated Ibn Abbas: Allah’s Messenger was the most generous of all the people, and he used to reach the peak in generosity in the month of Ramadan when Jibril met him. Jibril used to meet him every night of Ramadan to teach him the Quran.",
  "main": "كَانَ رَسُولُ اللَّهِ ﷺ أَجْوَدَ النَّاسِ، وَكَانَ أَجْوَدَ مَا يَكُونُ فِي رَمَضَانَ، حِينَ يَلْقَاهُ جِبْرِيلُ، وَكَانَ جِبْرِيلُ يَلْقَاهُ فِي كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ فَيُدَارِسُهُ الْقُرْآنَ",
  "ref": "Sahih al-Bukhari 5",
  "book": "Sahih al-Bukhari"
},

  {
    "id": 6,
    "bn": "আবদুল্লাহ ইবনে আব্বাস (রাঃ) বলেন, আবু সুফিয়ান আমাকে জানালেন যে, হিরাকল (বাইজেন্টাইন সম্রাট) তাঁকে ডেকে পাঠিয়েছিলেন যখন তিনি কুরাইশের একটি কাফেলার সঙ্গে ছিলেন।",
    "en": "Narrated Abdullah bin Abbas: Abu Sufyan bin Harb informed me that Heraclius had sent a messenger to him while he had been accompanying a caravan from Quraish...",
    "main": "",
    "ref": "Sahih al-Bukhari 6",
    "book": "Sahih al-Bukhari"
  },
  {
    "id": 7,
    "bn": "আল-বারা বিন আযিব (রাঃ) বলেন, সর্বপ্রথম যারা আমাদের কাছে (মদিনায়) আসেন তারা ছিলেন মুসআব ইবনে উমাইর এবং ইবনে উম্মে মাকতুম, যারা আমাদের কুরআন শেখাতেন।",
    "en": "Narrated Al-Bara bin Azib: The first people who came to us (in Medina) were Musab bin Umair and Ibn Umm Maktum who taught us the Quran...",
    "main": "",
    "ref": "Sahih al-Bukhari 7",
    "book": "Sahih al-Bukhari"
  },
  {
    "id": 8,
    "bn": "আনাস ইবনে মালিক (রাঃ) বলেন, রাসূল (সাঃ) বলেছেন: তিনটি গুণ যার মধ্যে থাকবে সে ঈমানের স্বাদ পাবে—যে ব্যক্তি আল্লাহ ও তাঁর রাসূলকে সবকিছুর চেয়ে বেশি ভালোবাসে, যে কাউকে শুধুমাত্র আল্লাহর সন্তুষ্টির জন্য ভালোবাসে, এবং যে কুফরিতে ফিরে যেতে ঘৃণা করে যেমন সে আগুনে নিক্ষিপ্ত হওয়াকে ঘৃণা করে।",
    "en": "Narrated Anas bin Malik: The Prophet said, 'Whoever possesses the following three qualities will have the sweetness of faith: The one to whom Allah and His Messenger become dearer than anything else, who loves a person and he loves him only for Allah’s sake, and who hates to revert to disbelief as he hates to be thrown into the fire.'",
    "main": "",
    "ref": "Sahih al-Bukhari 8",
    "book": "Sahih al-Bukhari"
  },
  {
    "id": 9,
    "bn": "আবু হুরায়রা (রাঃ) বলেন, রাসূলুল্লাহ (সাঃ) বলেছেন: ঈমানের (বিশ্বাসের) শাখা ষাটেরও বেশি, আর haya (লজ্জা) হল ঈমানের একটি শাখা।",
    "en": "Narrated Abu Huraira: The Prophet said, 'Faith (Belief) consists of more than sixty branches (i.e., parts). And Haya (modesty) is a part of faith.'",
    "main": "",
    "ref": "Sahih al-Bukhari 9",
    "book": "Sahih al-Bukhari"
  },
  {
    "id": 10,
    "bn": "আবদুল্লাহ ইবনে আমর (রাঃ) বলেন, রাসূলুল্লাহ (সাঃ) বলেছেন: একজন প্রকৃত মুসলিম সে, যার হাত ও জিহ্বা থেকে অন্য মুসলমান নিরাপদ থাকে। আর প্রকৃত মুহাজির সে, যে আল্লাহ যা নিষিদ্ধ করেছেন তা বর্জন করে।",
    "en": "Narrated Abdullah bin Amr: The Prophet said, 'A Muslim is the one who avoids harming Muslims with his tongue and hands. And a Muhajir (emigrant) is the one who gives up (abandons) all that Allah has forbidden.'",
    "main": "",
    "ref": "Sahih al-Bukhari 10",
    "book": "Sahih al-Bukhari"
  },
  {
    "id": 11,
    "bn": "আবু মূসা (রাঃ) বলেন, কিছু লোক রাসূল (সাঃ)-কে জিজ্ঞেস করল, ‘সর্বোত্তম ইসলাম কার?’ তিনি বললেন, 'যার হাত ও জিহ্বা থেকে মুসলমানরা নিরাপদ থাকে।’",
    "en": "Narrated Abu Musa: Some people asked Allah’s Messenger, 'Whose Islam is the best?' He replied, 'One who avoids harming the Muslims with his tongue and hands.'",
    "main": "",
    "ref": "Sahih al-Bukhari 11",
    "book": "Sahih al-Bukhari"
  },
  {
    "id": 12,
    "bn": "আনাস (রাঃ) বলেন, রাসূল (সাঃ) বলেছেন: ‘তোমাদের কেউ ঈমানদার হতে পারবে না যতক্ষণ না সে তার (মুসলিম) ভাইয়ের জন্য এমন কিছু চায়, যা সে নিজের জন্য চায়।’",
    "en": "Narrated Anas: The Prophet said, 'None of you will have faith till he wishes for his (Muslim) brother what he likes for himself.'",
    "main": "",
    "ref": "Sahih al-Bukhari 12",
    "book": "Sahih al-Bukhari"
  },
  {
    "id": 13,
    "bn": "আবু হুরায়রা (রাঃ) বলেন, রাসূল (সাঃ) বলেছেন: 'যাঁর হাতে আমার প্রাণ, তাঁর কসম করে বলছি, তোমাদের কেউ ঈমানদার হতে পারবে না যতক্ষণ না সে আমাকে তার পিতা ও সন্তানদের চেয়েও বেশি ভালোবাসে।’",
    "en": "Narrated Abu Huraira: Allah’s Messenger said, 'By Him in Whose Hands my life is, none of you will have faith till he loves me more than his father and his children.'",
    "main": "",
    "ref": "Sahih al-Bukhari 13",
    "book": "Sahih al-Bukhari"
  },
  {
    "id": 14,
    "bn": "আনাস (রাঃ) বলেন, রাসূল (সাঃ) বলেছেন: ‘তিনটি গুণ যার মধ্যে থাকবে সে ঈমানের স্বাদ পাবে—আল্লাহ ও তাঁর রাসূলকে সর্বাধিক ভালোবাসা, কাউকে শুধু আল্লাহর জন্য ভালোবাসা, এবং কুফরিতে ফিরে যেতে ঘৃণা করা।’",
    "en": "Narrated Anas: The Prophet said, 'Whoever possesses the following three qualities will taste the sweetness of faith: [repeats qualities from Hadith 8].'",
    "main": "",
    "ref": "Sahih al-Bukhari 14",
    "book": "Sahih al-Bukhari"
  },
  {
    "id": 15,
    "bn": "আবু হুরায়রা (রাঃ) বলেন, রাসূল (সাঃ) বলেছেন: 'যে ব্যক্তি আল্লাহ এবং পরকালের ওপর ঈমান রাখে, সে যেন কল্যাণকর কথা বলে অথবা চুপ থাকে। আর সে যেন তার প্রতিবেশীকে কষ্ট না দেয়।'",
    "en": "Narrated Abu Huraira: The Prophet said, 'Whoever believes in Allah and the Last Day should talk what is good or keep quiet, and whoever believes in Allah and the Last Day should not harm his neighbor...'",
    "main": "",
    "ref": "Sahih al-Bukhari 15",
    "book": "Sahih al-Bukhari"
  }
    
]
